app/Controllers/Admin/Berita.php

    public function kegiatan()
    {
        $data = array(
            'title' => 'KEGIATAN',
            'title2' => $this->M_settings->first(),
            'berita' => $this->M_berita->orderBy('tanggal', 'DESC')->findAll(),
---
SELECT *
FROM `3fi_berita`
ORDER BY `tanggal` DESC

    public function emagazine()
    {
        $data = array(
            'title' => 'E-Magazine',
            'title2' => $this->M_settings->first(),
            'emagazine' => $this->M_emagazine->orderBy('id', 'Desc')->findAll(),
---
SELECT *
FROM `3fi_emagazine`
ORDER BY `id` DESC