app/Controllers/Admin/Koperasi.php

SELECT *
FROM `3fi_datakopukm`
---
    public function data()
    {
        $data = array(
            'title' => 'Data KOPERASI',
            'menu' => 'koperasi',
            'title2' => $this->M_settings->first(),
            'datakoperasi' => $this->M_datakopukm->findAll(),

SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'KOPERASI'
ORDER BY `urutan` ASC
---
    public function perizinan()
    {
        $data = array(
            'title' => 'Perizinan KOPERASI',
            'menu' => 'koperasi',
            'title2' => $this->M_settings->first(),
            'perizinan' => $this->M_perizinan->where('kategori', 'KOPERASI')->orderBy('urutan', 'ASC')->findAll(),