app/Controllers/Admin/Link.php

SELECT *
FROM `3fi_link`
WHERE `kategori` = '2'
ORDER BY `id` DESC
---
    public function index()
    {
        $data = array(
            'title' => 'LINK TERKAIT',
            'title2' => $this->M_settings->first(),
            'link' => $this->M_link->where(['kategori' => '2'])->orderBy('id', 'DESC')->findAll(),