app/Controllers/Admin/Umkm.php

    public function data()
    {
        $data = array(
            'title' => 'Data UKM',
            'menu' => 'umkm',
            'title2' => $this->M_settings->first(),
            'dataukm' => $this->M_datakopukm->where('business_status_name', 'UMKM')->orderBy('data_id', 'DESC')->findAll(),
---
SELECT *
FROM `3fi_datakopukm`
WHERE `business_status_name` = 'UMKM'
ORDER BY `data_id` DESC

    public function perizinan()
    {
        $data = array(
            'title' => 'Perizinan UKM',
            'menu' => 'umkm',
            'title2' => $this->M_settings->first(),
            'perizinan' => $this->M_perizinan->where('kategori', 'UMKM')->orderBy('urutan', 'ASC')->findAll(),
---
SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'UMKM'
ORDER BY `urutan` ASC