app/Controllers/Berita.php

    public function index()
    {
        $data = array(
            'title' => 'BERITA',
            'settings'      => $this->M_settings->first(),
            'profile'       => $this->M_profile->orderBy('urutan', 'Asc')->findAll(),
            'berita'        => $this->M_berita->orderBy('tanggal', 'Desc')->findAll(6),
            'pengumuman'    => $this->M_pengumuman->orderBy('tanggal', 'Desc')->findAll(6),
            'peraturan'    => $this->M_peraturan->orderBy('tanggal', 'Desc')->findAll(6),
            'blog'          => $this->M_berita->orderBy('tanggal', 'Desc')->paginate(4),
            'umkm'          => $this->M_perizinan->where('kategori', 'UMKM')->orderBy('urutan', 'Asc')->findAll(),
            'koperasi'      => $this->M_perizinan->where('kategori', 'KOPERASI')->orderBy('urutan', 'Desc')->findAll(),
---
SELECT *
FROM `3fi_berita`
ORDER BY `tanggal` DESC
 LIMIT 6
SELECT *
FROM `3fi_pengumuman`
ORDER BY `tanggal` DESC
 LIMIT 6
SELECT *
FROM `3fi_peraturan`
ORDER BY `tanggal` DESC
 LIMIT 6
SELECT *
FROM `3fi_berita`
ORDER BY `tanggal` DESC
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `3fi_berita`
SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'UMKM'
ORDER BY `urutan` ASC
SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'KOPERASI'
ORDER BY `urutan` DESC