app/Controllers/Edu.php

SELECT *
FROM `3fi_edu`
WHERE `kategori` = 'UMKM'
ORDER BY `tanggal` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `3fi_edu`
WHERE `kategori` = 'UMKM'
SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'UMKM'
ORDER BY `urutan` DESC
SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'KOPERASI'
ORDER BY `urutan` DESC
---
    public function ukm()
    {
        $data = array(
            'title' => 'EDU UKM',
            'settings'      => $this->M_settings->first(),
            'profile'       => $this->M_profile->orderBy('urutan', 'Asc')->findAll(),
            'eduukm'        => $this->M_edu->where('kategori', 'UMKM')->orderBy('tanggal', 'Desc')->paginate(6),
            'umkm'          => $this->M_perizinan->where('kategori', 'UMKM')->orderBy('urutan', 'Desc')->findAll(),
            'koperasi'      => $this->M_perizinan->where('kategori', 'KOPERASI')->orderBy('urutan', 'Desc')->findAll(),

SELECT *
FROM `3fi_edu`
WHERE `judul_seo` = 'frontend'
SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'UMKM'
ORDER BY `urutan` DESC
SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'KOPERASI'
ORDER BY `urutan` DESC
SELECT *
FROM `3fi_berita`
ORDER BY `dilihat` DESC
 LIMIT 6
---
    public function ukm_detail($slug)
    {
        $data = array(
            'title' => 'EDU UKM',
            'settings'      => $this->M_settings->first(),
            'profile'       => $this->M_profile->orderBy('urutan', 'Asc')->findAll(),
            'ukm_detail'    => $this->M_edu->where('judul_seo', $slug)->findAll(),
            'umkm'          => $this->M_perizinan->where('kategori', 'UMKM')->orderBy('urutan', 'Desc')->findAll(),
            'koperasi'      => $this->M_perizinan->where('kategori', 'KOPERASI')->orderBy('urutan', 'Desc')->findAll(),
            'populer'       => $this->M_berita->orderBy('dilihat', 'Desc')->findAll(6),