app/Controllers/Galeri.php

SELECT *
FROM `3fi_galeri`
ORDER BY `tanggal` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `3fi_galeri`
SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'UMKM'
ORDER BY `urutan` ASC
SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'KOPERASI'
ORDER BY `urutan` DESC
---
    public function foto()
    {
        $data = array(
            'title' => 'GALERI FOTO',
            'settings'      => $this->M_settings->first(),
            'profile'       => $this->M_profile->orderBy('urutan', 'Asc')->findAll(),
            'galeri'          => $this->M_galeri->orderBy('tanggal', 'Desc')->paginate(6),
            'umkm'          => $this->M_perizinan->where('kategori', 'UMKM')->orderBy('urutan', 'Asc')->findAll(),
            'koperasi'      => $this->M_perizinan->where('kategori', 'KOPERASI')->orderBy('urutan', 'Desc')->findAll(),