app/Controllers/Informasi.php

    public function pengumuman()
    {
        $data = array(
            'title' => 'PENGUMUMAN',
            'settings'      => $this->M_settings->first(),
            'profile'       => $this->M_profile->orderBy('urutan', 'Asc')->findAll(),
            'populer'       => $this->M_berita->orderBy('dilihat', 'Desc')->findAll(5),
            'umkm'          => $this->M_perizinan->where('kategori', 'UMKM')->orderBy('urutan', 'Asc')->findAll(),
            'koperasi'      => $this->M_perizinan->where('kategori', 'KOPERASI')->orderBy('urutan', 'Desc')->findAll(),
            'pengumuman'    => $this->M_pengumuman->orderBy('tanggal', 'Desc')->paginate(4),
            'peraturan'    => $this->M_peraturan->orderBy('tanggal', 'Desc')->findAll(5),
---
SELECT *
FROM `3fi_berita`
ORDER BY `dilihat` DESC
 LIMIT 5
SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'UMKM'
ORDER BY `urutan` ASC
SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'KOPERASI'
ORDER BY `urutan` DESC
SELECT *
FROM `3fi_pengumuman`
ORDER BY `tanggal` DESC
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `3fi_pengumuman`
SELECT *
FROM `3fi_peraturan`
ORDER BY `tanggal` DESC
 LIMIT 5

    public function peraturan()
    {
        $data = array(
            'title' => 'PERATURAN',
            'settings'      => $this->M_settings->first(),
            'umkm'          => $this->M_perizinan->where('kategori', 'UMKM')->orderBy('urutan', 'Asc')->findAll(),
            'koperasi'      => $this->M_perizinan->where('kategori', 'KOPERASI')->orderBy('urutan', 'Desc')->findAll(),
            'profile'       => $this->M_profile->orderBy('urutan', 'Asc')->findAll(),
            'peraturan'    => $this->M_peraturan->orderBy('tanggal', 'Desc')->findAll(),
---
SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'UMKM'
ORDER BY `urutan` ASC
SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'KOPERASI'
ORDER BY `urutan` DESC
SELECT *
FROM `3fi_peraturan`
ORDER BY `tanggal` DESC