app/Controllers/Pelatihan.php

    public function index()
    {
        $data = array(
            'title' => 'Pelatihan',
            'settings'      => $this->M_settings->first(),
            'profile'       => $this->M_profile->orderBy('urutan', 'Asc')->findAll(),
            'umkm'          => $this->M_perizinan->where('kategori', 'UMKM')->orderBy('urutan', 'Asc')->findAll(),
            'koperasi'      => $this->M_perizinan->where('kategori', 'KOPERASI')->orderBy('urutan', 'Desc')->findAll(),
            'pelatihan'     => $this->M_pelatihan->orderBy('training_id', 'Desc')->join('3fi_training_category', '3fi_training_category.training_category_id = 3fi_pelatihan.training_category_id')->paginate(8),
---
SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'UMKM'
ORDER BY `urutan` ASC
SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'KOPERASI'
ORDER BY `urutan` DESC
SELECT *
FROM `3fi_pelatihan`
JOIN `3fi_training_category` ON `3fi_training_category`.`training_category_id` = `3fi_pelatihan`.`training_category_id`
ORDER BY `training_id` DESC
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `3fi_pelatihan`
JOIN `3fi_training_category` ON `3fi_training_category`.`training_category_id` = `3fi_pelatihan`.`training_category_id`