app/Controllers/Perizinan.php

SELECT *
FROM `3fi_perizinan`
WHERE `judul_seo` = 'frontend'
SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'UMKM'
ORDER BY `urutan` ASC
SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'KOPERASI'
ORDER BY `urutan` DESC
SELECT *
FROM `3fi_berita`
ORDER BY `tanggal` DESC
 LIMIT 6
SELECT *
FROM `3fi_berita`
ORDER BY `dilihat` DESC
 LIMIT 6
SELECT *
FROM `3fi_pengumuman`
ORDER BY `tanggal` DESC
 LIMIT 5
---
    public function detail($slug)
    {
        $data = array(
            'title'         => '',
            'settings'      => $this->M_settings->first(),
            'profile'       => $this->M_profile->orderBy('urutan', 'Asc')->findAll(),
            'perizinan'          => $this->M_perizinan->where('judul_seo', $slug)->findAll(),
            'umkm'          => $this->M_perizinan->where('kategori', 'UMKM')->orderBy('urutan', 'Asc')->findAll(),
            'koperasi'      => $this->M_perizinan->where('kategori', 'KOPERASI')->orderBy('urutan', 'Desc')->findAll(),
            'berita'        => $this->M_berita->orderBy('tanggal', 'Desc')->findAll(6),
            'populer'       => $this->M_berita->orderBy('dilihat', 'Desc')->findAll(6),
            'pengumuman'    => $this->M_pengumuman->orderBy('tanggal', 'Desc')->findAll(5),