app/Controllers/Web.php

SELECT *
FROM `3fi_berita`
ORDER BY `tanggal` DESC
 LIMIT 5
SELECT *
FROM `3fi_berita`
ORDER BY `tanggal` DESC
 LIMIT 1
SELECT *
FROM `3fi_berita`
ORDER BY `tanggal` DESC
 LIMIT 1, 5
SELECT *
FROM `3fi_slideshow`
ORDER BY `id` DESC
 LIMIT 5
SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'UMKM'
ORDER BY `urutan` DESC
SELECT *
FROM `3fi_perizinan`
WHERE `kategori` = 'KOPERASI'
ORDER BY `urutan` DESC
SELECT *
FROM `3fi_pelatihan`
JOIN `3fi_training_category` ON `3fi_training_category`.`training_category_id` = `3fi_pelatihan`.`training_category_id`
ORDER BY `training_id` DESC
 LIMIT 4
SELECT *
FROM `3fi_galeri`
ORDER BY `id_galeri` DESC
SELECT *
FROM `3fi_emagazine`
ORDER BY `id` DESC
SELECT *
FROM `3fi_link`
ORDER BY `id` DESC
SELECT *
FROM `3fi_pengumuman`
ORDER BY `id` DESC
 LIMIT 7
SELECT *
FROM `3fi_peraturan`
ORDER BY `id` DESC
 LIMIT 8
SELECT *
FROM `3fi_banner`
SELECT *
FROM `3fi_popup`
SELECT *
FROM `3fi_video`
ORDER BY `id` DESC
SELECT *
FROM `3fi_edu`
WHERE `kategori` = 'UMKM'
ORDER BY `id` DESC
SELECT *
FROM `3fi_edu`
WHERE `kategori` = 'KOPERASI'
ORDER BY `id` DESC
---
    public function index()
    {
        $data = array(
            'title'         => 'HOME',
            'settings'      => $this->M_settings->first(),
            'newsflash'     => $this->M_berita->orderBy('tanggal', 'Desc')->findAll(5),
            'kegiatan'      => $this->M_berita->orderBy('tanggal', 'Desc')->findAll(1),
            'kegiatanthumb' => $this->M_berita->orderBy('tanggal', 'Desc')->findAll(5, 1),
            'slider'        => $this->M_slideshow->orderBy('id', 'Desc')->findAll(5),
            'profile'       => $this->M_profile->orderBy('urutan', 'Asc')->findAll(),
            'umkm'          => $this->M_perizinan->where('kategori', 'UMKM')->orderBy('urutan', 'Desc')->findAll(),
            'koperasi'      => $this->M_perizinan->where('kategori', 'KOPERASI')->orderBy('urutan', 'Desc')->findAll(),
            'pelatihan'     => $this->M_pelatihan->orderBy('training_id', 'Desc')->join('3fi_training_category', '3fi_training_category.training_category_id = 3fi_pelatihan.training_category_id')->findAll(4),
            'galeri'        => $this->M_galeri->orderBy('id_galeri', 'Desc')->findAll(),
            'magazine'      => $this->M_emagazine->orderBy('id', 'Desc')->findAll(),
            'link'          => $this->M_link->orderBy('id', 'Desc')->findAll(),
            'pengumuman'    => $this->M_pengumuman->orderBy('id', 'Desc')->findAll(7),
            'peraturan'     => $this->M_peraturan->orderBy('id', 'Desc')->findAll(8),
            'banner'        => $this->M_banner->limit('1')->findAll(),
            'popup'        => $this->M_popup->limit('1')->findAll(),
            'video'         => $this->M_video->orderBy('id', 'Desc')->findAll(),
            'eduukm'         => $this->M_edu->where('kategori', 'UMKM')->orderBy('id', 'Desc')->findAll(),
            'edukop'         => $this->M_edu->where('kategori', 'KOPERASI')->orderBy('id', 'Desc')->findAll(),